-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: localhost    Database: cinemadb
-- ------------------------------------------------------
-- Server version	8.1.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
USE cinemadb;
--
-- Table structure for table `films`
--

DROP TABLE IF EXISTS `films`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `films` (
  `film_id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `director` varchar(50) DEFAULT NULL,
  `duration` int NOT NULL,
  `description` longtext NOT NULL,
  `poster` varchar(225) NOT NULL,
  `trailer` varchar(225) DEFAULT NULL,
  `rating` double DEFAULT '10',
  `count_ratings` int DEFAULT '0',
  PRIMARY KEY (`film_id`),
  UNIQUE KEY `name_UNIQUE` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `films`
--

LOCK TABLES `films` WRITE;
/*!40000 ALTER TABLE `films` DISABLE KEYS */;
INSERT INTO `films` VALUES (3,'Крижане серце','Кріс Бак, Дженніфер Лі',102,'Безстрашна оптимістка Анна вирушає в мандрівку разом із суворим альпіністом Крістофом та його вірним оленем Свеном. Разом вони шукають сестру Анни – Ельзу. Її крижана сила замкнула королівство Арендель у вічній зимі. В умовах, схожих на Еверест, зустрівши містичних тролів та кумедного сніговика на ім\'я Олаф, Анна та Крістофф борються зі стихією, намагаючись врятувати королівство.','Холодне_сердце.jpg','Крижане_серце.mp4',7.857142857142857,7),(4,'Довбуш','Олесь Санін',123,'Карпати. Початок 18 століття. Жорстоке правління польської шляхти змушує гуцулів тікати в гори. Двоє братів, Олекса та Іван Довбуші, опиняються поза законом і стають опришками. У пошуках помсти панам за вбивство батьків Довбушів, брати стають ворогами один одному. Один прагне грошей, другий — справедливості. Гуцули починають повстання, яке очолює Олекса. Шляхта робить усе можливе, аби знищити Довбуша. Але він їх перехитрив. І розрослася легенда про карпатського лицаря. Легенда, що надихає покоління тих, хто бореться за свободу рідної землі. Про силу і любов Олекси Довбуша, про зраду і кривду. Про те, як він жив і як обманув смерть.','Довбуш.jpg','Довбуш.mp4',10,0),(5,'Оппенгеймер','Крістофер Нолан',180,'Масштабна історія про винайдення атомної бомби американським вченим Робертом Оппенгеймером від одного з найвидатніших режисерів сучасності – Крістофера Нолана!','Оппенгеймер.jpg','Оппенгеймер.mp4',10,0),(6,'Привиди у Венеції','Кеннет Брана',104,'Фільм «Привиди у Венеції» оповідає жахливу історію, героєм якої стає знаменитий детектив Еркюль Пуаро. Події стрічки розгортаються у моторошній повоєнній Венеції напередодні Дня всіх святих. Пуаро саме вийшов на пенсію і живе наодинці в найгламурнішому місті світу. Одного разу він неохоче відвідує спіритичний сеанс у занедбаному палаццо з привидами. Та коли одного з гостей вбивають, детектив змушений зануритися у зловісний світ тіней і таємниць. ','Привиди_у_Венеції.jpg','Привиди_у_Венеції.mp4',10,0),(7,'Вбивці квіткової повні','Мартін Скорсезе',206,'Леонардо Ді Капріо та Роберт Де Ніро у новому фільмі Мартіна Скорсезе! Детективна історія про вбивство корінних жителів Сполучених Штатів — племені Осейджу у 1920-х, що призвела до масштабного розслідування ФБР.','Вбивці_квіткової_повні.jpeg','Вбивці_квіткової_повні.mp4',10,0),(8,'Королева Боудіка','Джессі Джонсон',100,'Кельтська воїтелька Боудіка править народом Ікені разом зі своїм чоловіком. Король гине від рук римських солдатів, залишаючи королівство  без спадкоємця чоловічої статі. Римляни захоплюють землю та майно королеви.','Королева_Боудіка.jpg','Королева_Боудіка.mp4',7,1),(9,'Скажений експрес','Олів’є Ван Хофстад',89,'Це мала бути звичайна поїздка перед підвищенням. Але йому прислали найсуворішу інспекторку, яка пильнує за кожним кроком. Ще й конкуренти шкодять. Уся поїздка вийшла з-під контролю, бо схоже, що в цьому потягу зібрались  найбожевільніші пасажири. Та він піде на все, щоб отримати роботу мрії!','Скажений_експрес.jpg','Скажений_експрес.mp4',5,3),(10,'Щенячий Патруль: Мегакіно','Келлан Брункер',93,'Щенячий патруль повертається у новій анімаційній пригоді! Завдяки чарівному метеориту, що впав на Бухту Пригод, Щенячий патруль отримує нові мега сили для боротьби з противниками. Начувайтеся лиходії, могутні щенята вже близько!','Щенячий_Патруль.jpg','Щенячий_Патруль.mp4',6.333333333333333,3),(34,'Наполеон 16+','Рідлі Скотт',158,'Наполеон Бонапарт (Хоакін Фенікс) створив одну з найбільших імперій світу та увійшов у історію як законодавець та реформатор Європи. Однак все це не було самоціллю. Найбільшим прагненням Наполеона було підкорити серце Жозефіни (Ванесса Кірбі), а потім – робити все, аби викликати її похвалу та захват.\nВійськова біографічна драма «Наполеон» знята за сценарієм Девіда Скарпа режисером Рідлі Скотом. За свою кар’єру Рідлі Скот зрежисував 53 фільми та на понад 150 проектах був продюсером. Зняті ним фільми висувалися на премію «Оскар» 31 раз. На головну роль запросили Хоакіна Фенікса («Джокер», «Гладіатор»). Роль Жозефіни спершу планувалося віддати Джоді Комер, однак вона вибула з проекту через пандемію та розбіжності у графіках. Основний знімальний процес проходив у Великобританії. Зокрема, декоратори тиждень працювали у Лінкольнському соборі, аби в ньому знімали події, які відбувалися у Нотр-Дам де Парі. Також зйомки проходили на Мальті.\n','Наполеон.jpg','Наполеон.mp4',10,0);
/*!40000 ALTER TABLE `films` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-12-04 22:03:02
